Namespace Help
    Public Enum Type
        None

        '------------------------------------
        'ｺﾝｽﾀﾝﾄ
        '------------------------------------
        M区分_フラグ
        M区分_重要度
        M区分_消費税区分
        M区分_請求書発行区分
        M区分_回収方法
        M区分_定番品区分
        M区分_在庫区分
        M区分_取引先区分
        M区分_新再版区分
        M区分_単位区分
        M区分_仕入先指定区分
        M区分_納入区分
        M区分_支給区分
        M区分_希望時間帯区分
        M区分_完納区分
        M区分_売上指示区分
        M区分_売上指示区分運賃

        '------------------------------------
        'ｼｽﾃﾑ
        '------------------------------------

        '------------------------------------
        'ﾏｽﾀ
        '------------------------------------
        M糊
        M紙
        M得意先
        M得意先個人
        M出荷先
        M仕入先
        M取引先
        M機械
        M台紙
        M担当者
        M印刷場所
        M印刷機械種別
        M締日情報
        M売伝パターン
        M品名
        M大分類
        M小分類
        Mヤマト店所
        Mヤマト区分
        Mヤマト種別

        '------------------------------------
        'ﾄﾗﾝｻﾞｸｼｮﾝ
        '------------------------------------
        T受注基本

        '------------------------------------
        'その他
        '------------------------------------
    End Enum
End Namespace
