Namespace List
    Public Enum Type
        None

        '------------------------------------
        'ｺﾝｽﾀﾝﾄ
        '------------------------------------
        M区分_紙種別
        M区分_機械区分
        M区分_機械種別区分
        M区分_再利用区分
        'M区分_売上日計表対象
        M区分_場所区分
        M区分_単価区分
        M区分_消費税区分
        M区分_請求書発行区分
        M区分_回収方法
        M区分_定番品区分
        M区分_在庫区分
        M区分_買掛金未払金区分
        M区分_種別内訳区分
        M区分_帳票区分
        M区分_工程区分
        M区分_発注単位区分
        M区分_取引先区分
        M区分_社内外区分
        M区分_確約区分
        M区分_刃型区分
        M区分_受注区分
        M区分_フレキ機械種別区分
        M区分_刃型形状区分
        M区分_新再版区分
        M区分_単位区分
        M区分_仕入先指定区分
        M区分_納入区分
        M区分_支給区分
        M区分_希望時間帯区分
        M区分_完納区分
        M区分_売上指示区分
        M区分_売上指示区分運賃
        M区分_巻取区分
        M区分_出し方向区分
        M区分_スリッター区分

        '------------------------------------
        'ｼｽﾃﾑ
        '------------------------------------

        '------------------------------------
        'ﾏｽﾀ
        '------------------------------------

        '------------------------------------
        'ﾄﾗﾝｻﾞｸｼｮﾝ
        '------------------------------------

        '------------------------------------
        'その他
        '------------------------------------
    End Enum
End Namespace
